In [39]:
import pandas as pd
import numpy as np

In [40]:
df = pd.read_csv("sample_bank_statement.csv")
df.head()

,Date,Details,Amount,Currency,Debit/Credit,Status,Unnamed: 6
0,28 Feb 2025,Card Payment Received,"18,551.62",AED,Credit,SETTLED,
1,15 Feb 2025,EMIRATES INSURANCE,137.95,AED,Debit,SETTLED,NaN
2,04 Feb 2025,NOON.COM,110.69,AED,Debit,SETTLED,NaN
3,23 Feb 2025,Card Payment Received,"12,351.42",AED,Credit,SETTLED,NaN
4,05 Oct 2024,LULU HYPERMARKET,455.00,AED,Debit,SETTLED,NaN

In [41]:
df["Date"] = pd.to_datetime(df["Date"])
df.head()

,Date,Details,Amount,Currency,Debit/Credit,Status,Unnamed: 6
0,2025-02-28,Card Payment Received,"18,551.62",AED,Credit,SETTLED,
1,2025-02-15,EMIRATES INSURANCE,137.95,AED,Debit,SETTLED,NaN
2,2025-02-04,NOON.COM,110.69,AED,Debit,SETTLED,NaN
3,2025-02-23,Card Payment Received,"12,351.42",AED,Credit,SETTLED,NaN
4,2024-10-05,LULU HYPERMARKET,455.00,AED,Debit,SETTLED,NaN

In [42]:
df.set_index("Date", inplace = True)
df.head()

,Details,Amount,Currency,Debit/Credit,Status,Unnamed: 6
Date,,,,,,
2025-02-28,Card Payment Received,"18,551.62",AED,Credit,SETTLED,
2025-02-15,EMIRATES INSURANCE,137.95,AED,Debit,SETTLED,NaN
2025-02-04,NOON.COM,110.69,AED,Debit,SETTLED,NaN
2025-02-23,Card Payment Received,"12,351.42",AED,Credit,SETTLED,NaN
2024-10-05,LULU HYPERMARKET,455.00,AED,Debit,SETTLED,NaN

In [43]:
df["Amount"] = df["Amount"].str.replace(",", "", regex=False).astype(float)
df.head()

,Details,Amount,Currency,Debit/Credit,Status,Unnamed: 6
Date,,,,,,
2025-02-28,Card Payment Received,18551.62,AED,Credit,SETTLED,
2025-02-15,EMIRATES INSURANCE,137.95,AED,Debit,SETTLED,NaN
2025-02-04,NOON.COM,110.69,AED,Debit,SETTLED,NaN
2025-02-23,Card Payment Received,12351.42,AED,Credit,SETTLED,NaN
2024-10-05,LULU HYPERMARKET,455.00,AED,Debit,SETTLED,NaN

In [44]:
monthly_exp = df.resample("ME")["Amount"].sum()
print(f"Monthly Expense is: ")
monthly_exp

Monthly Expense is:

Date
2024-10-31    20597.22
2024-11-30    56169.42
2024-12-31    25192.01
2025-01-31     9614.37
2025-02-28    36111.50
2025-03-31    22501.69
Freq: ME, Name: Amount, dtype: float64